<?php defined('ACC') || exit('ACC Denied');
require(ROOT . 'view/header.php'); ?>


<div class="container mt-3">
    <div class="row">
        <div class="col-md-12 main m-1 shadow-sm color-background rounded p-3">

            <table class="color-font-default" cell-spacing="0" cell-padding="5" align="center" border="0">
                <tbody>
                    <tr>
                        <td>
                            <h2 class="title color-font-default"><i class="fa-solid fa-signs-post"></i>&nbsp;饭岛协议</h2>
                        </td>
                    </tr>
                    <tr>
                        <td>
                            </p>
                            <br>
                            <span class="color-font-default title">第一条 总则</span>
                            <blockquote>
                                <p class="color-font-default">1.1 <i class="fa-solid fa-hand-spock"></i>&nbsp;欢迎光临饭岛！<br> 请您仔细阅读以下条款，如果您对本协议的任何条款表示异议，您可以选择不进入饭岛；进入饭岛则意味着您将同意遵守本协议下全部规定，并完全服从于饭岛的统一管理。阅读本协议的过程中，如果您不同意本协议或其中任何条款约定，请您立即停止使用我们的服务。<br>
                                    饭岛目前不收取任何服务费用，但饭岛保留将来收取费用的权利，如果要收取费用，在您使用任何收费服务前应向您清楚告知收费事宜。我们会根据有关法律法规的变化、公司经营状况、经营策略调整和软件升级等原因修订本协议。更新后的协议条款公布后即有效代替原来的协议条款。如果您不同意协议改动内容，请您立即停止使用饭岛及服务。如果您继续使用饭岛，则视为接受本协议的改动。

                                <p class="color-font-default">如果您未满18周岁，请立刻停止使用饭岛。 </p>
                            </blockquote>
                            <p class="color-font-default">
                                <span class="color-font-default title">第二条 饭岛用户权利及行为规范</span>
                            </p>
                            <blockquote>
                                2.1 凡是注册用户和浏览用户均为饭岛用户（以下统称"用户"）。
                                <br>2.2 用户享有言论自由的权利。
                                <br>2.3 用户行为规范：用户的言行不得违反《计算机信息网络国际联网安全保护管理办法》、《互联网信息服务管理办法》、《维护互联网安全的决定》、《互联网新闻信息服务管理规定》、《长江保护法》、《中华人民共和国测绘法》、《地图管理条例》、《网络安全法》、《未成年人保护法》、《互联网宗教信息服务管理办法》等相关法律法规规定和饭岛平台政策，不得进行任何违法或不正当的活动，包括但不限于：
                                <blockquote>
                                    2.3.1 反对宪法所确定的基本原则的；
                                    <br>2.3.2 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；
                                    <br>2.3.3 损害国家荣誉和利益的；
                                    <br>2.3.4 煽动民族仇恨、民族歧视、破坏民族团结的；
                                    <br>2.3.5 破坏国家宗教政策，宣扬邪教和封建迷信的；
                                    <br>2.3.6 散布谣言，扰乱社会秩序，破坏社会稳定的；
                                    <br>2.3.7 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；
                                    <br>2.3.8 侮辱或者诽谤他人，侵害他人合法权利的；
                                    <br>2.3.9 煽动非法集会、结社、游行、示威、聚众扰乱社会秩序的；
                                    <br>2.3.10 以非法民间组织名义活动的；
                                    <br>2.3.11 含有虚假、有害、胁迫、侵害他人隐私、骚扰、侵害、中伤、粗俗、猥亵、或其它道德上令人反感的内容；
                                    <br>2.3.12 侵犯他人知识产权或其他合法权益的；
                                    <br>2.3.13 <del>与电鱼、毒鱼、炸鱼等破坏渔业资源和生态环境的捕捞行为相关的违法违规内容（包括但不限于文字、图片、动态、视频等）；</del>
                                    <br>2.3.14 含违规地图或者与违规地图相关的内容（包括但不限于文字、图片、动态、视频等）；
                                    <br>2.3.15 含有违法违规互联网宗教信息内容或行为，包括但不限于：
                                    <blockquote>
                                        （1）利用宗教煽动颠覆国家政权、反对中国共产党的领导，破坏社会主义制度、国家统一、民族团结和社会稳定，宣扬极端主义、恐怖主义、民族分裂主义和宗教狂热的；
                                        <br>（2）利用宗教妨碍国家司法、教育、婚姻、社会管理等制度实施的；
                                        <br>（3）利用宗教宣扬邪教和封建迷信，或者利用宗教损害公民身体健康，欺骗、胁迫取得财物的；
                                        <br>（4）违背我国宗教独立自主自办原则的；
                                        <br>（5）破坏不同宗教之间、同一宗教内部以及信教公民与不信教公民之间和睦相处的;
                                        <br>（6）歧视、侮辱信教公民或者不信教公民，损害信教公民或者不信教公民合法权益的；
                                        <br>（7）从事违法宗教活动或者为违法宗教活动提供便利的；
                                        <br>（8）诱导未成年人信教，或者组织、强迫未成年人参加宗教活动的；
                                        <br>（9）以宗教名义进行商业宣传，经销、发送宗教用品、宗教内部资料性出版物和非法出版物的；
                                        <br>（10）假冒宗教教职人员开展活动的；
                                        <br><del>（11）传教；</del>
                                        <br>（12）开展宗教教育培训、发布讲经讲道内容或者转发、链接相关内容；
                                        <br>（13）组织开展宗教活动；
                                        <br>（14）以文字、图片、音视频等方式直播或者录播拜佛、烧香、受戒、诵经、礼拜、弥撒、受洗等宗教仪式；
                                        <br>（15）成立宗教组织、设立宗教院校和宗教活动场所、发展教徒；
                                        <br>（16）以宗教名义开展募捐；
                                    </blockquote>
                                    2.3.16 含有中国法律、法规、规章、条例以及任何具有法律效力之规范所限制或禁止的其它内容的。
                                </blockquote>
                                2.4 用户在饭岛发表文章时，除遵守本协议外，还需遵守所在各版的相关规定。
                                <br>2.5 用户不得在饭岛内发布未经授权的广告.
                                <br>2.6 用户应承担一切因其个人的行为而直接或间接导致的民事或刑事法律责任，因用户行为给白宙公司造成损失的，用户应负责赔偿。
                                <br>2.7 饭岛基金会及饭岛执政官拥有对违反本站规则的用户进行处理的权力，直至禁止其在本饭岛内发布信息。
                                <br>2.8 禁止任何使用软件进行内容批量发布的行为。
                                <br>2.9 任何用户发现饭岛文章内容涉嫌侮辱或者诽谤他人、侵害他人合法权益的或违反饭岛协议的，有权按饭岛投诉规则进行投诉。
                            </blockquote>
                            <p class="color-font-default">
                                <span class="color-font-default title">第三条 权利声明</span>
                            </p>
                            <blockquote class="color-font-default">
                                3.1 您拥有并控制对用户内容的所有权利，或除此之外拥有向平台或通过平台发布与分配用户内容的合法权利；
                                <br>3.2 您有权将此类许可授予饭岛和其关联公司、他们各自的服务提供商、和他们各自的被许可人、继承人和受让人；
                                <br>3.3 您所有的用户内容都将遵守本条款，社区约章和任何适用法律法规的规定，不得侵犯任何人或实体的任何权利，或对任何人或实体造成伤害；
                                <br>3.4 您对您发布的任何用户内容负责，并且由您，而不是饭岛，承担对此类用户内容的全部责任，包括合法性、可信性、准确性和合适性。
                            </blockquote>
                            <p class="color-font-default">
                                <span class="color-font-default title">第四条 处罚规则</span>
                            </p>

                            <blockquote class="color-font-default">
                                4.1 白宙公司郑重提醒用户，若出现下列情况任意一种或几种，将承担包括被关闭全部或者部分权限、被暂停或被删除其帐号的后果，情节严重的，还将承担相应的法律责任。
                                <blockquote>
                                    4.1.1 发表含有猥亵、色情、人身攻击和反政府言论等非法或侵权言论的；
                                    <br>4.1.2 从事非法商业活动；
                                    <br>4.1.3 使用软件进行内容批量发布的行为；
                                    <br>4.1.4 侵犯他人知识产权或其他合法权益的；
                                    <br>4.1.5 其他白宙公司认为不恰当的情况。
                                </blockquote>
                                4.2 凡文章出现以下情况之一，饭岛管理人员有权不提前通知作者直接删除，并依照有关规定作相应处罚。情节严重者，饭岛管理人员有权对其做出关闭部分权限、暂停直至删除其帐号。
                                <blockquote>
                                    4.2.1 发表含有本协议第2.3条禁止发布、传播内容的文章；
                                    <br>4.2.2 发表不符合版面主题，或者无内容的灌水文章；
                                    <br>4.2.3 同一文章多次出现的；
                                    <br>4.2.4 违反本协议第2.5条的规定，发布广告的；
                                    <br>4.2.5 文章内容或个人签名会包含有严重影响用户浏览的内容或格式的；
                                    <br>4.2.6 其他白宙公司认为不恰当的情况。
                                </blockquote>
                            </blockquote>

                            <p class="color-font-default">
                                <span class="color-font-default title"> 第五条 用户注意事项</span>
                            </p>
                            <blockquote class="color-font-default">
                                5.1 当您在使用饭岛内第三方提供的产品或服务时，请您遵守第三方的用户协议。白宙公司不对您与第三方提供的产品或服务可能出现的纠纷承担责任。
                                <br>5.2 因用户使用饭岛或要求饭岛提供特定服务时，饭岛可能会调用第三方系统或者通过第三方支持用户的使用或访问，使用或访问的结果由该第三方提供（包括但不限于第三方通过个人中心接入的内容等），白宙公司不保证通过第三方提供服务及内容的安全性、准确性、有效性及其他不确定的风险，因此若引发的任何争议及损害，与白宙公司无关，白宙公司不承担任何责任。
                                <br>5.3 若您忘记了账户密码，可以使用您已验证过的注册邮箱向饭岛客服机器人发送信件以说明原因。
                                机器人邮箱：Codd@whiteverse.com
                                <br>5.4 您的钱包功能随注册附送，它将在验证邮箱后变得可用。由于遵循匿名原则，钱包地址并不公开，但饭岛保留用户公开的权利。

                            </blockquote>


                            <p class="color-font-default">
                                <span class="color-font-default title"> 第六条 用户个人信息保护</span>
                            </p>
                            <blockquote class="color-font-default">
                                6.1 保护用户个人信息是白宙公司的一项基本原则，白宙公司将会采取合理的措施保护用户的个人信息。除法律法规规定的情形外，未经用户许可白宙公司不会向第三方公开、透露用户个人信息。白宙公司饭岛的《隐私政策》介绍了您在使用饭岛服务时，白宙公司如何收集和使用您的个人信息。您使用饭岛的服务，即表示您同意白宙公司可以按照《隐私政策》收集和使用您的个人信息。白宙公司对相关信息采用专业加密存储与传输方式，保障用户个人信息的安全。
                                <br>6.2 您在申请饭岛服务过程中，需要填写一些必要的信息，请保持这些信息的真实、准确、合法、有效并注意及时更新，以便白宙公司向您提供及时有效的帮助，或更好地为您提供服务。根据相关法律法规和政策，请您填写真实的身份信息。若您填写的信息不完整或不准确，则可能无法使用饭岛服务或在使用过程中受到限制。
                                <br>6.3 一般情况下，您可随时浏览、修改自己提交的信息，但出于安全性和身份识别（如账号申诉服务）的考虑，您可能无法修改注册时提供的初始注册信息及其他验证信息。
                                <br>6.4 白宙公司将运用各种安全技术和程序建立完善的管理制度来保护您的个人信息，以免遭受未经授权的访问、使用或披露。
                                <br>6.5 未经您的同意，白宙公司不会向白宙公司以外的任何公司、组织和个人披露您的个人信息，但法律法规另有规定的除外。
                                <br>6.6 白宙公司非常重视对未成年人个人信息的保护。若您是18周岁以下的未成年人，在使用饭岛服务前，应事先取得您家长或法定监护人的书面同意。
                                <br>6.7 您应对通过本服务了解、接收或可接触到的包括但不限于其他用户在内的任何人的个人信息予以充分尊重，您不应以搜集、复制、存储、传播或以其他任何方式使用其他用户的个人信息，否则，由此产生的后果由您自行承担。
                            </blockquote>

                            <p class="color-font-default">
                                <span class="color-font-default title">第七条 知识产权及相关权益</span>
                            </p>
                            <blockquote>
                                8.1 白宙公司保留对以下各项内容、信息完全的、不可分割的所有权及知识产权：
                                <blockquote>
                                    8.1.1 饭岛及其所有元素，包括但不限于所有内容、数据、技术、软件、代码、用户界面、商标、logo等商业标识以及与其相关的任何衍生作品。
                                    <br>8.1.2 用户向饭岛服务提供的与该服务相关的任何信息及反馈。
                                </blockquote>
                                8.2 未经白宙公司同意，上述资料均不得在任何媒体直接或间接发布、播放、出于播放或发布目的而改写或再发行，或者被用于其他任何商业目的。上述资料或其任何部分仅可作为私人用途而保存在某台计算机内。白宙公司不就由上述资料产生或在传送或递交全部或部分上述资料过程中产生的延误、不准确、错误和遗漏或从中产生或由此产生的任何损害赔偿，以任何形式向用户或任何第三方负法律、经济责任。
                                <br>8.3 饭岛为提供网络服务而使用的任何软件（包括但不限于软件中所含的任何图像、照片、动画、录像、录音、音乐、文字和附加程序、随附的帮助材料）的一切权利均属于该软件的著作权人，未经该软件的著作权人许可，用户不得对该软件进行反向工程（reverse engineer）、反向编译（decompile）或反汇编（disassemble），或以其他方式发现其原始编码，以及实施任何涉嫌侵害著作权的行为。
                                <br>8.4 您理解并同意，您向任何第三人分享、转发、复制饭岛平台信息内容的行为，均应遵守饭岛平台为此制定的规范和标准，包括但不限于展示方式应为该信息或内容的原链接、确保附属于该信息或内容的功能可正常使用等。
                                <br>8.5 任何未经白宙公司书面同意及权利人许可的非法获取行为，均属违法侵权行为。
                                <br>8.6 您可以使用平台上的信息，但仅供您个人使用。除非在版权法下另有明确许可，否则在未经饭岛和版权所有者明确许可的情况下，不得对下载内容进行复制、再分配、出版或商业利用。在允许复制、再分配或出版版权内容的情况下，不得更改或删除作者归属、商标说明或版权声明。您承认您不会通过下载版权内容来获得任何所有权。
                            </blockquote>


                            <p class="color-font-default">
                                <span class="color-font-default title">第八条 免责声明</span>
                            </p>

                            <blockquote>
                                9.1 鉴于网络服务的特殊性，用户同意饭岛随时变更、中断或终止部分或全部的网络服务。如变更、中断或终止的网络服务属于免费网络服务，饭岛无需通知用户，也无需对任何用户或任何第三方承担任何责任。
                                <br>9.2 您理解，饭岛需要定期或不定期地对提供网络服务的平台或相关的设备进行检修或者维护，如因此类情况而造成收费网络服务在合理时间内的中断，饭岛无需为此承担任何责任，但饭岛应尽可能事先进行通告。
                                <br>9.3 饭岛可在任何时候为任何原因变更本服务或删除其部分功能。饭岛可在任何时候取消或终止对用户的服务。饭岛取消或终止服务的决定不需要理由或通知用户。一旦服务取消，用户使用饭岛的权利立即终止。一旦饭岛取消或终止，用户在饭岛中储存的任何信息可能无法恢复。
                                <br>9.4 饭岛不保证（包括但不限于）:
                                <blockquote>
                                    9.4.1 饭岛适合用户的使用要求；
                                    <br>9.4.2 饭岛不受干扰，及时、安全、可靠或不出现错误，用户经由饭岛取得的任何产品、服务或其他材料符合用户的期望；
                                    <br>9.4.3 您使用经由饭岛取得的任何资料，其风险由您自行承担；因该等使用导致您的电脑系统损坏或资料流失，您应自己负完全责任。
                                </blockquote>
                                9.5 基于以下原因而造成的利润、商业信誉、资料损失或其他有形或无形损失，白宙公司不承担任何直接、间接的赔偿：
                                <blockquote>
                                    9.5.1 对饭岛的使用或无法使用；
                                    <br>9.5.2 经由饭岛购买或取得的任何产品、资料或服务；
                                    <br>9.5.3 您的资料遭到未授权的使用或修改；及其他与饭岛相关的事宜。
                                </blockquote>
                                9.6 由于您授权第三方（包括第三方应用）访问/使用其饭岛所导致的纠纷或损失，应由您自行承担。
                                <br>9.7 白宙公司会根据您选择的服务类型向您提供相应的服务。您理解并同意，基于用户体验或饭岛运营安全、平台规则要求及健康发展等综合因素，白宙公司有权选择提供服务或开展合作的对象，有权决定功能开放、数据接口和相关数据披露的对象和范围，并有权视具体情况中止或终止向存有包括但不限于以下情形的用户提供本服务：
                                <blockquote>
                                    9.7.1 违反法律法规或本协议规定的；
                                    <br>9.7.2 影响使用者体验的；
                                    <br>9.7.3 存在安全隐患的；
                                    <br>9.7.4 违背饭岛运营原则，或不符合白宙公司其他管理要求的。
                                </blockquote>
                            </blockquote>

                            <p class="color-font-default">
                                <span class="color-font-default title">第九条 投诉处理</span>
                            </p>
                            <blockquote>
                                如果用户发现有什么不合适的内容，请前往<b><a href="view.php?id=3">举报页面</a></b>进行举报。
                            </blockquote>
                        </td>
                    </tr>
                </tbody>
            </table>
            <div class=" footText d-md-block">
                <hr class="footHr" />
                <div class="footContent color-font-secondary">
                    <div>&copy; <?php echo date("Y", time()); ?> <a href="https://whiteverse.city/">whiteverse.city</a>.All rights reserved.</div>
                    <div><?php echo SITEVERSION; ?></div>
                </div>
            </div>

        </div>
    </div>
</div>

</div>
<?php include(ROOT . 'view/footer.php'); ?>
<script>
    $(document).ready(function() {
        $("#menuBtn").remove();
        $(".navbar-brand").after(' <a href="index.php"><button class="btn color-button-primary "><i class="fa-solid fa-arrow-left"></i><i class="fa-solid fa-home"></i>&nbsp;回到首页</button></a>');
    });
</script>